Revit 2027 API
CurtainGridLine.ExistingSegmentCurves Property
Retrieve all the existing segment curves of the grid line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveArray ExistingSegmentCurves { get; }
Public ReadOnly Property ExistingSegmentCurves As CurveArray
	Get
public:
property CurveArray^ ExistingSegmentCurves {
	CurveArray^ get ();
}
member ExistingSegmentCurves : CurveArray with get
Property Value
CurveArray
Remarks
User can get these curves and call RemoveSegment() to remove the segments to the gridline or call AddMullions() to add mullions to these segments.
See Also
Reference
CurtainGridLine Class
Autodesk.Revit.DB Namespace